package com.askprice.carprice.common.util;

public enum City {
	
	合肥(101,"安徽"),
    安庆(102,"安徽"),
    蚌埠(103,"安徽"),
    巢湖(104,"安徽"),
    池州(105,"安徽"),
    阜阳(106,"安徽"),
    淮北(107,"安徽"),
    淮南(108,"安徽"),
    六安(109,"安徽"),
    马鞍山(110,"安徽"),
    铜陵(113,"安徽"),
    芜湖(114,"安徽"),
    宣城(115,"安徽"),
    滁州(116,"安徽"),
    黄山(118,"安徽"),
    宿州(120,"安徽"),
    亳州(125,"安徽"),
    
    北京(201,"北京"),

    福州(301,"福建"),
    厦门(302,"福建"),
    龙岩(303,"福建"),
    漳州(305,"福建"),
    莆田(306,"福建"),
    泉州(307,"福建"),
    南平(314,"福建"),
    宁德(315,"福建"),
    三明(318,"福建"),

  
    兰州(401,"甘肃"),
    定西(402,"甘肃"),
    平凉(405,"甘肃"),
    临夏(407,"甘肃"),
    酒泉(409,"甘肃"),
    张掖(410,"甘肃"),
    庆阳(411,"甘肃"),
    武威(412,"甘肃"),
    天水(415,"甘肃"),
    嘉峪关(416,"甘肃"),
    金昌(417,"甘肃"),
    白银(418,"甘肃"),
    陇南(421,"甘肃"),
    甘南(422,"甘肃"),
    临夏回族自治州(622900,"甘肃"),

  
    广州(501,"广东"),
    深圳(502,"广东"),
    珠海(503,"广东"),
    东莞(504,"广东"),
    中山(505,"广东"),
    汕头(507,"广东"),
    潮州(510,"广东"),
    韶关(511,"广东"),
    湛江(513,"广东"),
    肇庆(514,"广东"),
    茂名(515,"广东"),
    梅州(516,"广东"),
    佛山(518,"广东"),
    惠州(520,"广东"),
    江门(521,"广东"),
    揭阳(522,"广东"),
    清远(524,"广东"),
    云浮(528,"广东"),
    阳江(532,"广东"),
    河源(535,"广东"),
    汕尾(552,"广东"),

  
    南宁(601,"广西"),
    柳州(602,"广西"),
    桂林(603,"广西"),
    北海(604,"广西"),
    百色(605,"广西"),
    贺州(606,"广西"),
    河池(607,"广西"),
    贵港(608,"广西"),
    玉林(610,"广西"),
    钦州(612,"广西"),
    梧州(613,"广西"),
    防城港(615,"广西"),
    来宾(619,"广西"),
    崇左(621,"广西"),
    

  
    贵阳(701,"贵州"),
    遵义(702,"贵州"),
    安顺(705,"贵州"),
    毕节(706,"贵州"),
    六盘水(708,"贵州"),
    铜仁(710,"贵州"),
    黔东南(714,"贵州"),
    黔南(715,"贵州"),
    毕节地区(717,"贵州"),
    黔西南(718,"贵州"),
    铜仁地区(719,"贵州"),

  
    海口(801,"海南"),
    三亚(803,"海南"),
    琼北(810,"海南"),
    琼南(811,"海南"),
    
    

  
    石家庄(901,"河北"),
    唐山(902,"河北"),
    邢台(903,"河北"),
    秦皇岛(905,"河北"),
    廊坊(906,"河北"),
    邯郸(907,"河北"),
    衡水(908,"河北"),
    沧州(909,"河北"),
    保定(910,"河北"),
    张家口(911,"河北"),
    承德(912,"河北"),

  
    郑州(1001,"河南"),
    洛阳(1002,"河南"),
    周口(1003,"河南"),
    信阳(1004,"河南"),
    新乡(1005,"河南"),
    商丘(1006,"河南"),
    三门峡(1007,"河南"),
    濮阳(1008,"河南"),
    南阳(1009,"河南"),
    漯河(1010,"河南"),
    焦作(1011,"河南"),
    开封(1013,"河南"),
    安阳(1014,"河南"),
    鹤壁(1016,"河南"),
    平顶山(1018,"河南"),
    济源(1019,"河南"),
    驻马店(1021,"河南"),
    许昌(1023,"河南"),
    省直辖县级行政区划(419000,"河南"),

  
    哈尔滨(1101,"黑龙江"),
    大庆(1102,"黑龙江"),
    齐市(1103,"黑龙江"),
    鹤岗(1104,"黑龙江"),
    佳木斯(1106,"黑龙江"),
    鸡西(1107,"黑龙江"),
    牡丹江(1108,"黑龙江"),
    七台河(1109,"黑龙江"),
    伊春(1112,"黑龙江"),
    黑河(1113,"黑龙江"),
    双鸭山(1123,"黑龙江"),
    绥化(1131,"黑龙江"),
    兴安(1136,"黑龙江"),

    武汉(1201,"湖北"),
    十堰(1202,"湖北"),
    襄阳(1203,"湖北"),
    随州(1204,"湖北"),
    仙桃(1205,"湖北"),
    宜昌(1207,"湖北"),
    黄石(1208,"湖北"),
    荆门(1209,"湖北"),
    荆州(1210,"湖北"),
    恩施(1215,"湖北"),
    鄂州(1216,"湖北"),
    咸宁(1217,"湖北"),
    潜江(1219,"湖北"),
    孝感(1229,"湖北"),
    黄冈(1236,"湖北"),
    恩施土家族苗族自治州(422800,"湖北"),
    

  
    长沙(1301,"湖南"),
    郴州(1302,"湖南"),
    常德(1303,"湖南"),
    衡阳(1304,"湖南"),
    怀化(1305,"湖南"),
    娄底(1306,"湖南"),
    株洲(1307,"湖南"),
    岳阳(1308,"湖南"),
    湘潭(1309,"湖南"),
    邵阳(1310,"湖南"),
    永州(1312,"湖南"),
    益阳(1313,"湖南"),
    张家界(1315,"湖南"),
    湘西(1333,"湖南"),
    

  
    长春(1401,"吉林"),
    吉林(1402,"吉林"),
    通化(1403,"吉林"),
    辽源(1405,"吉林"),
    白山(1406,"吉林"),
    白城(1412,"吉林"),
    松原(1425,"吉林"),
    延边(1428,"吉林"),
    四平(1616,"吉林"),
    

  
    南京(1501,"江苏"),
    苏州(1502,"江苏"),
    无锡(1503,"江苏"),
    常熟(1504,"江苏"),
    常州(1505,"江苏"),
    淮安(1507,"江苏"),
    江阴(1508,"江苏"),
    昆山(1509,"江苏"),
    连云港(1510,"江苏"),
    南通(1511,"江苏"),
    盐城(1512,"江苏"),
    扬州(1513,"江苏"),
    张家港(1514,"江苏"),
    镇江(1515,"江苏"),
    泰州(1517,"江苏"),
    徐州(1518,"江苏"),
    宿迁(1520,"江苏"),
    太仓(1521,"江苏"),
    

  
    南昌(1601,"江西"),
    上饶(1602,"江西"),
    萍乡(1603,"江西"),
    新余(1604,"江西"),
    宜春(1605,"江西"),
    九江(1606,"江西"),
    赣州(1607,"江西"),
    吉安(1609,"江西"),
    景德镇(1612,"江西"),
    抚州(1613,"江西"),
    鹰潭(1615,"江西"),
    

  
    沈阳(1701,"辽宁"),
    丹东(1702,"辽宁"),
    抚顺(1703,"辽宁"),
    阜新(1704,"辽宁"),
    葫芦岛(1705,"辽宁"),
    朝阳(1707,"辽宁"),
    大连(1708,"辽宁"),
    本溪(1709,"辽宁"),
    鞍山(1710,"辽宁"),
    锦州(1711,"辽宁"),
    辽阳(1713,"辽宁"),
    营口(1714,"辽宁"),
    盘锦(1716,"辽宁"),
    铁岭(1717,"辽宁"),
    

  
    呼市(1801,"内蒙古"),
    包头(1802,"内蒙古"),
    赤峰(1803,"内蒙古"),
    通辽(1804,"内蒙古"),
    乌海(1805,"内蒙古"),
    鄂市(1808,"内蒙古"),
    呼盟(1812,"内蒙古"),
    兴安2(1814,"内蒙古"),
    巴盟(1824,"内蒙古"),
    乌盟(1825,"内蒙古"),
    锡盟(1829,"内蒙古"),
    阿拉善(1830,"内蒙古"),

  
    银川(1901,"宁夏"),
    吴忠(1902,"宁夏"),
    固原(1903,"宁夏"),
    石嘴山(1905,"宁夏"),
    中卫(1907,"宁夏"),

  
    西宁(2001,"青海"),
    海北(2023,"青海"),
    黄南(2024,"青海"),
    果洛(2025,"青海"),
    玉树(2026,"青海"),
    海西(2027,"青海"),
    海东(2029,"青海"),
    海南(2030,"青海"),
    

  
    德州(1015,"山东"),
    济南(2101,"山东"),
    青岛(2102,"山东"),
    烟台(2103,"山东"),
    威海(2104,"山东"),
    潍坊(2105,"山东"),
    泰安(2106,"山东"),
    枣庄(2107,"山东"),
    淄博(2109,"山东"),
    东营(2110,"山东"),
    菏泽(2112,"山东"),
    滨州(2113,"山东"),
    聊城(2114,"山东"),
    临沂(2117,"山东"),
    济宁(2118,"山东"),
    日照(2120,"山东"),
    烟威(2126,"山东"),
    莱芜(2132,"山东"),

  
    太原(2201,"山西"),
    大同(2202,"山西"),
    晋城(2203,"山西"),
    晋中(2204,"山西"),
    临汾(2205,"山西"),
    长治(2206,"山西"),
    运城(2207,"山西"),
    忻州(2210,"山西"),
    阳泉(2218,"山西"),
    朔州(2219,"山西"),
    吕梁(2227,"山西"),
    

  
    西安(2301,"陕西"),
    咸阳(2302,"陕西"),
    渭南(2303,"陕西"),
    榆林(2304,"陕西"),
    宝鸡(2305,"陕西"),
    安康(2306,"陕西"),
    汉中(2307,"陕西"),
    延安(2308,"陕西"),
    铜川(2310,"陕西"),
    商洛(2313,"陕西"),
    
 		上海(2401,"上海"),

    成都(2501,"四川"),
    绵阳(2502,"四川"),
    遂宁(2503,"四川"),
    攀枝花(2504,"四川"),
    宜宾(2506,"四川"),
    雅安(2507,"四川"),
    自贡(2508,"四川"),
    资阳(2509,"四川"),
    广元(2510,"四川"),
    德阳(2511,"四川"),
    乐山(2512,"四川"),
    南充(2513,"四川"),
    眉山(2514,"四川"),
    巴中(2516,"四川"),
    泸州(2517,"四川"),
    内江(2519,"四川"),
    广安(2530,"四川"),
    达州(2532,"四川"),
    阿坝(2535,"四川"),
    甘孜(2536,"四川"),
    凉山(2537,"四川"),
    
    天津(2601,"天津"),
    

  
    拉萨(2701,"西藏"),
    日喀则(2703,"西藏"),
    山南(2704,"西藏"),
    那曲(2705,"西藏"),
    阿里(2707,"西藏"),
    山南地区(2708,"西藏"),
    昌都(2709,"西藏"),
    林芝(2710,"西藏"),
    

  
    乌市(2801,"新疆"),
    喀什(2802,"新疆"),
    克市(2803,"新疆"),
    哈密(2806,"新疆"),
    吐鲁番(2807,"新疆"),
    塔城(2812,"新疆"),
    昌吉(2813,"新疆"),
    阿勒泰(2815,"新疆"),
    阿克苏(2817,"新疆"),
    和田(2818,"新疆"),
    博州(2821,"新疆"),
    巴州(2822,"新疆"),
    伊犁(2823,"新疆"),
    喀什地区(2828,"新疆"),
    阿克苏地区(2829,"新疆"),
    和田地区(2830,"新疆"),
    塔城地区(2831,"新疆"),
    吐鲁番地区(2832,"新疆"),
    哈密地区(2833,"新疆"),
    阿勒泰地区(2834,"新疆"),
    克州(2835,"新疆"),
    昌吉回族自治州(652300,"新疆"),
    自治区直辖县级行政区划(659000,"新疆"),

  
    昆明(2901,"云南"),
    玉溪(2902,"云南"),
    曲靖(2903,"云南"),
    大理(2904,"云南"),
    保山(2907,"云南"),
    楚雄(2908,"云南"),
    临沧(2911,"云南"),
    文山(2914,"云南"),
    版纳(2915,"云南"),
    昭通(2918,"云南"),
    丽江(2922,"云南"),
    红河(2923,"云南"),
    德宏(2925,"云南"),
    怒江(2927,"云南"),
    迪庆(2928,"云南"),
    普洱(2929,"云南"),
    楚雄彝族自治州(532300,"云南"),
    大理白族自治州(532900,"云南"),
    

  
    杭州(3001,"浙江"),
    宁波(3002,"浙江"),
    温州(3003,"浙江"),
    嘉兴(3005,"浙江"),
    金华(3006,"浙江"),
    丽水(3009,"浙江"),
    湖州(3011,"浙江"),
    衢州(3012,"浙江"),
    台州(3015,"浙江"),
    绍兴(3016,"浙江"),
    舟山(3020,"浙江"),
    余慈(339000,"浙江"),
    乐清地区(339100,"浙江"),
    

  
    重庆(3101,"重庆"),
    万州(500101,"重庆"),
	;

	public Integer getCode()
	{
		return code;
	}
	
	public String getProvince()
	{
		return province;
	}

	private Integer code;
	
	private String province;

	private City(Integer code, String province)
	{
		this.code = code;
		this.province = province;
	}
	
}
